espressif/esp-idf/examples/ethernet/iperf/sdkconfig.ci.psram_yt8531_esp32s31
# Common / performance options live in sdkconfig.defaults

CONFIG_IDF_TARGET="esp32s31"

CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

# Config Ethernet Init
CONFIG_ETHERNET_INTERNAL_SUPPORT=y
CONFIG_ETHERNET_PHY_YT8531=y

# Allocate EMAC buffers in PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y # to able to derive RGMII CLKs
CONFIG_ETH_DMA_USE_PSRAM=y
